app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" IS NULL
---
  def samedirector
    movie = Movie.find(params[:id])
    director_name = movie.director
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}
    if not director_name or director_name.empty?
      flash[:notice] = "'#{Movie.find(params[:id]).title}' has no director info."